CSI API ETABS v1

# cSapModelDatabaseTables Property

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    cDatabaseTables DatabaseTables { get; }

    ReadOnly Property DatabaseTables As cDatabaseTables
    	Get

    Dim instance As cSapModel
    Dim value As cDatabaseTables

    value = instance.DatabaseTables

    property cDatabaseTables^ DatabaseTables {
    	cDatabaseTables^ get ();
    }

    abstract DatabaseTables : cDatabaseTables with get

#### Property Value

Type: cDatabaseTables

See Also

#### Reference

cSapModel Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com